<template>
    <div class="wrapper mb-80">
        <div class="container">
            <div class="row mt-80">
                <AboutCompany :abouts="aboutCompany" />
            </div>
            <div class="row mt-80">
                <Masonry :photos="photos" />
            </div>
            <div class="row mt-80">
                <Advantages :title="advantagesTitleHead" :advantages="advantagesItems" />
            </div>
            <div class="row">
                <DefinitelyProduct />
            </div>
            <div class="row mt-80">
                <AboutCompany :abouts="aboutCompanyInfo" />
            </div>
        </div>
    </div>
</template>

<script>
    import Advantages from "@/components/Advantages/Advantages";
    import DefinitelyProduct from "@/components/DefinitelyProduct/DefinitelyProduct";
    import AboutCompany from "@/components/AboutCompany/AboutCompany";
    import Masonry from "@/components/Masonry/Masonry";

    export default {
        name: 'AboutUs',
        components: {
            AboutCompany,
            Masonry,
            Advantages,
            DefinitelyProduct,
        },
        props: {

        },
        data: () => ({
            aboutCompany: [{
                title: 'О компании',
                descriptions: ['«Ямской фермер» образовался в 2010 году. У нас тогда были совсем маленькие дети, очень склонные к аллергиям. И когда встала проблема первых прикормов, по совету педиатра начали искать, где взять для них натуральные продукты. А потом и подумали – если такие продукты нужны нам, возможно, они пригодятся кому-то еще? Так и оказалось. За эти годы нашими покупателями стали около 10 тысяч семей из Петербурга и пригородов.', 'Сейчас мы привозим экопродукты с более чем 30 ферм Ленобласти, от экофермеров Кубани, Абхазии, Тульской области, в общем, со всей России. География и ассортимент расширились, но принципы остались те же – только действительно натуральные продукты, только проверенные фермы, которые мы видели своими глазами. До сих пор и мы сами, и наши дети едят только продукты с «Зеленого Хутора». От аллергии даже следа не осталось!'],
            }],
            aboutCompanyInfo: [{
                title: 'О компании',
                descriptions: ['Душа моя озарена неземной радостью, как эти чудесные весенние утра, которыми я наслаждаюсь от всего сердца. Я совсем один и блаженствую в здешнем краю, словно созданном для таких, как я.', 'Я так счастлив, мой друг, так упоен ощущением покоя, что искусство мое страдает от этого. Ни одного штриха не мог бы я сделать, а никогда не был таким большим художником, как в эти минуты.', ' Когда от милой моей долины поднимается пар и полдневное солнце стоит над непроницаемой чащей темного леса и лишь редкий луч проскальзывает в его святая святых, а я лежу в высокой траве у быстрого ручья и, прильнув к земле, вижу тысячи всевозможных былинок и чувствую, как близок моему сердцу крошечный мирок, что снует между стебельками, наблюдаю эти неисчислимые, непостижимые разновидности червяков и мошек и чувствую близость всемогущего, создавшего нас по своему подобию, веяние вселюбящего, судившего нам парить в вечном блаженстве, когда взор мой туманится и все вокруг меня и небо надо мной запечатлены в моей душе, точно образ возлюбленной, — тогда, дорогой друг, меня часто томит мысль: "Ах!', 'Как бы выразить, как бы вдохнуть в рисунок то, что так полно, так трепетно живет во мне, запечатлеть отражение моей души, как душа моя — отражение предвечного бога!'],
            }],
            advantagesTitleHead: 'Покупая продукты в «Ямском фермере», вы получаете:',
            advantagesItems: [{
                advantagesTitle: 'Экономию деньги на лекарствах',
                advantagesDescriptions: 'ВОЗ рекомендует выбирать экологичные продукты для охранения здоровья взрослых и детей.',
            }, {
                advantagesTitle: 'Натуральность',
                advantagesDescriptions: 'Когда, где и кто произвел этот продукт — мы работаем с поставщиком напрямую и сами забираем продукты на фермах. Также мы проверяем продукты в независимой лаборатории на их натуральность.',
            }, {
                advantagesTitle: 'Уверены в безопасности продуктов',
                advantagesDescriptions: 'Продукты имеют все необходимые свидетельства и сертификаты. Наши продукты по-настоящему натуральные и вкусные.',
            }, {
                advantagesTitle: 'Удовольствие',
                advantagesDescriptions: 'Поддерживаете экологичные методы сельского хозяйства. Не тратите время на беготню по рынкам и супермаркертам.',
            }],
            photos: [{
                img: '1.png',
                large: true,
            }, {
                img: '2.png',
                small: true,
            }, {
                img: '3.png',
                small: true,
            }, {
                img: '4.png',
                medium: true,
            }, {
                img: '5.png',
                medium: true,
            }]
        }),
        computed: {},
        methods: {}
    }
</script>

<style scoped lang="scss">
    @import '@/assets/scss/vars';
</style>
